
##vim查找替换
[来源](http://www.chinavim.org/vivim-%E6%9F%A5%E6%89%BE%E6%9B%BF%E6%8D%A2%E5%A4%A7%E5%85%A8.html)

* 可以使用 # 作为分隔符，此时中间出现的 / 不会作为分隔符

 :替换当前行第一个 vivian/ 为 sky/

* `:n,$s/vivian/sky/` 替换第 n 行开始到最后一行中每一行的**第一个** vivian 为 sky

* `:n,$s/vivian/sky/g` 替换第 n 行开始到最后一行中每一行**所有** vivian 为 sky

------
###基本语法:

	:[地址/范围]s/<搜索字>/<替换字>[/g]

* 地址/范围有:
	* 无 :当前行
	* 1,10 : 1~10行
	* 1,$  1~最后一行/文件结束 ps : 1,$ 等价于 % 
	* .,.+10 从当前行(".") 到偏置10行(".+10") "+"表示向下偏移 "-"表示向上偏移 
	* (n 为数字，若 n 为 .<句号>，表示从当前行开始到最后一行)
* s=sed 风格的搜索
* / 分割符
* g  表示继续匹配(没有 表示匹配一次)

ps:更多sed语法请搜索sed
### 删除
删除括号内的东西 不包含括号 di) =delet in )
光标在一个word内部删除这个整个单词 diw  del in word
删除并进入insert模式方便修改 ciw change in word 
